---
type: ElementMulticlassFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ElementMulticlassFilter

`Autodesk.Revit.DB.ElementMulticlassFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementMulticlassFilter | — | `` |
| Method | PassesFilter | — | `` |